### Terraform Plan Created
**Plan Summary:** Plan: 0 to add, 4 to change, 0 to destroy.

<details>
<summary>Click to view the full Terraform plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.acm.cloudflare_dns_record.validation["launchplate-react.gloweet.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "validation" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "_45ca424fa84389a652a5006a6b5f67df.xlfgrmvvlj.acm-validations.aws" -> "_45ca424fa84389a652a5006a6b5f67df.xlfgrmvvlj.acm-validations.aws."
      ~ created_on          = "2025-06-19T00:11:33Z" -> (known after apply)
        id                  = "54cd443359b53ac57e50392556b9cd8a"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-06-19T19:42:42Z" -> (known after apply)
      ~ name                = "_219d34a0f9574970fc8f535eef0380a1.launchplate-react.gloweet.com" -> "_219d34a0f9574970fc8f535eef0380a1.launchplate-react.gloweet.com."
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.acm.cloudflare_dns_record.validation["www.launchplate-react.gloweet.com"] will be updated in-place
  ~ resource "cloudflare_dns_record" "validation" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "_c6b2caa4b475c106285ab29d7dde1da2.xlfgrmvvlj.acm-validations.aws" -> "_c6b2caa4b475c106285ab29d7dde1da2.xlfgrmvvlj.acm-validations.aws."
      ~ created_on          = "2025-06-19T00:11:33Z" -> (known after apply)
        id                  = "7e5190cbfeb56bc99ca0946f3b87ec0a"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-06-19T19:42:42Z" -> (known after apply)
      ~ name                = "_e07dbc4d11eda5f6b01b0cc6cd18098f.www.launchplate-react.gloweet.com" -> "_e07dbc4d11eda5f6b01b0cc6cd18098f.www.launchplate-react.gloweet.com."
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.routes.cloudflare_dns_record.proxied_route["enabled"] will be updated in-place
  ~ resource "cloudflare_dns_record" "proxied_route" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-06-19T00:11:24Z" -> (known after apply)
        id                  = "7a1aff0f7305c00548d96e39372098dc"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-06-19T00:11:24Z" -> (known after apply)
      ~ name                = "launchplate-react.gloweet.com" -> "launchplate-react"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.routes.cloudflare_dns_record.this["www.launchplate-react"] will be updated in-place
  ~ resource "cloudflare_dns_record" "this" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-06-19T00:17:20Z" -> (known after apply)
        id                  = "ff8c1fb0d6bfcd8291073109c4378953"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-06-19T19:42:43Z" -> (known after apply)
      ~ name                = "www.launchplate-react.gloweet.com" -> "www.launchplate-react"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

Please review the plan and comment:
- `/apply` to apply these changes (only members of the `@Gloweet/terraform-approvers` team(s) can approve)

**Notes:** Only members of the `@Gloweet/terraform-approvers` team(s) can approve and trigger the apply.